FI/Potilaan perustiedot/Integraatiopalvelu_Potilaanperustiedot_Esimerkkisanoma_GetPatientData_Request_10.0.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:lif="Lifecare.Integration.PatientDataIntegration" xmlns:lif1="Lifecare.Integration.Common.Contracts" xmlns:lif2="Lifecare.Integration.PatientDataIntegration.Contracts">
   <soapenv:Header/>
   <soapenv:Body>
      <lif:GetPatientDataRequest>
         <!--Optional:-->
         <lif:MessageHeader>
            <!--Optional:-->
            <!--type: string-->
            <lif1:MessageID>gero et</lif1:MessageID>
            <!--Optional:-->
            <!--type: string-->
            <lif1:TransactionID>sonoras imperio</lif1:TransactionID>
            <!--Optional:-->
            <!--type: string-->
            <lif1:SenderID>quae divum incedo</lif1:SenderID>
            <!--Optional:-->
            <!--type: string-->
            <lif1:SenderApplication>verrantque per auras</lif1:SenderApplication>
            <!--type: string-->
            <lif1:ReceiverID>per auras</lif1:ReceiverID>
            <!--Optional:-->
            <!--type: string-->
            <lif1:ReceiverApplication>circum claustra</lif1:ReceiverApplication>
            <!--Optional:-->
            <!--type: string-->
            <lif1:CharacterSet>nimborum in</lif1:CharacterSet>
            <!--Optional:-->
            <!--type: string-->
            <lif1:DataServiceURL>foedere certo</lif1:DataServiceURL>
            <!--Optional:-->
            <!--type: string-->
            <lif1:UserLanguageCode>profundum quippe ferant</lif1:UserLanguageCode>
            <!--Optional:-->
            <!--type: string-->
            <lif1:VersionNumber>et carcere</lif1:VersionNumber>
         </lif:MessageHeader>
         <!--Optional:-->
         <lif:Common>
            <!--Optional:-->
            <!--type: string-->
            <lif1:ContractKey>iovis rapidum iaculata</lif1:ContractKey>
            <!--Optional:-->
            <!--type: string-->
            <lif1:CallingSystem>speluncis abdidit</lif1:CallingSystem>
            <lif1:Area>
               <!--Optional:-->
               <!--type: string-->
               <lif1:CodeSetName>bella gero et</lif1:CodeSetName>
               <!--Optional:-->
               <!--type: string-->
               <lif1:CodeSetId>flammas turbine</lif1:CodeSetId>
               <!--Optional:-->
               <!--type: string-->
               <lif1:CodeValue>hoc metuens</lif1:CodeValue>
               <!--Optional:-->
               <!--type: string-->
               <lif1:CodeDescription>ac vinclis</lif1:CodeDescription>
            </lif1:Area>
            <lif1:UserIdentifiers>
               <!--Zero or more repetitions:-->
               <lif1:UserIdentifier>
                  <!--type: UserIdentifierCodeId - enumeration: [SOCIAL_SECURITY_NUMBER,SV_CODE,TERHIKKI_CODE,EFFICA_USER_ID]-->
                  <lif1:UserIdentifierCodeId>TERHIKKI_CODE</lif1:UserIdentifierCodeId>
                  <!--type: string-->
                  <lif1:UserIdentifierCode>circum claustra</lif1:UserIdentifierCode>
                  <!--type: string-->
                  <lif1:FamilyName>coniunx una</lif1:FamilyName>
                  <!--type: string-->
                  <lif1:GivenNames>arce sceptra</lif1:GivenNames>
                  <!--type: string-->
                  <lif1:Profession>circum claustra fremunt</lif1:Profession>
               </lif1:UserIdentifier>
            </lif1:UserIdentifiers>
            <lif1:Function>
               <!--Optional:-->
               <!--type: string-->
               <lif1:CodeSetName>certo et premere</lif1:CodeSetName>
               <!--Optional:-->
               <!--type: string-->
               <lif1:CodeSetId>et montis</lif1:CodeSetId>
               <!--Optional:-->
               <!--type: string-->
               <lif1:CodeValue>feta furentibus</lif1:CodeValue>
               <!--Optional:-->
               <!--type: string-->
               <lif1:CodeDescription>sed pater</lif1:CodeDescription>
            </lif1:Function>
            <!--Optional:-->
            <lif1:ReasonCode>
               <!--Optional:-->
               <!--type: string-->
               <lif1:CodeSetName>talia flammato secum</lif1:CodeSetName>
               <!--Optional:-->
               <!--type: string-->
               <lif1:CodeSetId>austris aeoliam</lif1:CodeSetId>
               <!--Optional:-->
               <!--type: string-->
               <lif1:CodeValue>sciret dare</lif1:CodeValue>
               <!--Optional:-->
               <!--type: string-->
               <lif1:CodeDescription>dare iussus</lif1:CodeDescription>
            </lif1:ReasonCode>
         </lif:Common>
         <!--Optional:-->
         <lif:PatientId>
            <!--Optional:-->
            <!--type: string-->
            <lif2:Identifier>bella gero</lif2:Identifier>
         </lif:PatientId>
         <!--Optional:-->
         <!--type: boolean-->
         <lif:FetchDead>true</lif:FetchDead>
      </lif:GetPatientDataRequest>
   </soapenv:Body>
</soapenv:Envelope>